;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
(package! exec-path-from-shell)
(package! flymake-shellcheck)
(package! flyspell-lazy)
(package! git-link)
(package! git-timemachine)
(package! gptel)
(package! agent-shell :recipe (:host github :repo "xenodium/agent-shell"))
(package! json-reformat)
(package! powerthesaurus) ;; TODO https://github.com/SavchenkoValeriy/emacs-powerthesaurus
(package! string-inflection :recipe (:host github :repo "akicho8/string-inflection" :files ("string-inflection.el")))
(package! transient-posframe :recipe (:host github :repo "yanghaoxie/transient-posframe" :files ("*.el")))
(package! vterm-toggle)
(package! ruff-format)
(package! flymake-ruff)

;; (package! dired-dragon :recipe (:host github :repo "jeetelongname/dired-dragon"))
;; (package! graphviz-dot-mode)
;; (package! json5 :recipe (:host github :repo "nbfalcon/json5.el" :files ("*.el")))
;; (package! magit-pretty-graph :recipe (:host github :repo "georgek/magit-pretty-graph" :files ("*.el")))
;; (package! mermaid-mode)
;; (package! ob-mermaid)
;; (package! vc-msg)
;; (package! websocket)
;; (package! org-ai)
;; (package! md-roam :recipe (:host github :repo "nobiot/md-roam"))
;; (package! magit-todos :disable t)
;; (package! codeium :recipe (:host github :repo "Exafunction/codeium.el"))


;; (package! shackle) ;; TODO
;; (package! burly)
;; (package! popper)
;; (package! mini-frame)
;; (package! mini-popup :recipe (:host github :repo "minad/mini-popup" :files ("*.el")))
;;(package! zoxide)
;;(package! ctable)
;;(package! crdt) ;; TODO
;;(package! bitwarden :recipe (:host github :repo "seanfarley/emacs-bitwarden" :files ("bitwarden.el")))
;;(package! xwwp :recipe (:host github :repo "BlueFlo0d/xwwp" :files ("*.el" "*.js" "*.css" "*" )))
;; (package! org-roam-bibtex)
;;(unpin! dirvish)
;;(package! dirvish)
;;(package! org-tree-slide)
;;(package! osm)
;;(package! elcord)
;;(package! org-jira)
;; (unpin! lsp-mode)
;; (package! lsp-mode :pin "11c0c7af611ecb63f7797caae66fb03ba10c8c1e")
;;(package! hass) ;; TODO home-assistant integration
;;(package! power-mode :recipe (:host github :repo "elizagamedev/power-mode.el" :files ("*.el")))
;;(package! activity-watch-mode)
;;(package! org-excalidraw :recipe (:host github :repo "wdavew/org-excalidraw" :files ("*.el")))
;;(package! fixed-pitch :recipe (:host github :repo "cstby/fixed-pitch-mode"))
;; (Package! company-graphviz-dot)
;;(package! copilot
;;  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
;;(package! org-pdftools)
;;(package! org-noter-pdftools)
;;(package! org-noter)
;;(package! eziam-themes)
;;(package! gptai)
;; (package! chatgpt-arcana :recipe (:host github :repo "CarlQLange/ChatGPT-Arcana.el" :files ("*.el")))
;;(package! ibrowse :recipe (:host github :repo "nicolas-graves/ibrowse.el" :files ("*.el")))
;;(package! company-tabnine)
;;(package! telega) ;; TODO
;;(package! anki-editor)
;;(package! org-caldav)
;;(package! org-fragtog)
;;(package! vulpea)
;;(package! mini-modeline)
;;(package! autothemer) ;; TODO
;;(package! org-roam-ui)
;;(;;;;package! nov)
;;(;;package! calibredb)
;;(;;package! tree-edit) ;; TODO
;;(package! evil-tree-edit) ;; TODO
;;(package! kbd-mode    :recipe (:host github :repo "kmonad/kbd-mode" :files ("kbd-mode.el")))
;;(package! motoko-mode :recipe (:host github :repo "dfinity/motoko"  :files ("emacs/motoko-mode.el")))
(package! nyan-mode)
;;(package! org-analyzer) ;; TODO
;;(package! lsp-tailwindcss :recipe (:host github :repo "merrickluo/lsp-tailwindcss")) ;; TODO
;;(package! gitmoji :recipe (:host github :repo "janusvm/emacs-gitmoji" :files ("*.el" "data")))
;;(package! org-transclusion)
;;(package! org-mind-map :recipe (:host github :repo "the-ted/org-mind-map" :files ("*.el")))
;; (package! company-graphviz-dot)
;; (package! org-anki :recipe (:host github :repo "smallstepman/org-anki" :files ("*.el")))
;;(unpin! rustic)
;; (package! webkit :recipe (:host github :repo "akirakyle/emacs-webkit" :files ("*.js" "*.css" "*.el" "*.so" "*.h" "*.c" "Makefile")  :pre-build ("make")))
;; (package! tab-bar-echo-area)
;; (package! vertico-posframe :recipe (:host github :repo "tumashu/vertico-posframe")    :pin "cd54c3f022a47afc0a540eee117efc38289ae72d")
;; (package! narrow-region-other-window)
;; (package! svg-tag-mode) ;
;; (package! exwm)
;; (package! exwm-outer-gaps
;;   :recipe (:host github
;;            :repo "lucasgruss/exwm-outer-gaps"))
;; (package! svelte-mode)
;; (package! monkeytype)
;; (package! leetcode)
;; (package! oj.el)
;; (package! emacs-bitwarden)
;; (package! frog-jump-buffer)
;; (package! soundklaus)
;; (package! emms)
;; (package! counsel-spotify)
;; (package! spotify)
;; (package! which-key-posframe)
;; (package! graphql-mode)
;; (package! eaf)
;; (package! deferred)
;; (package! epc)

;;(package! toc-org)
;; (package! vertico-posframe) ;; TODO
;;(package! blamer)
